FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/ThirdParty/MSP432/NetworkInterface.c
/*
 * FreeRTOS+TCP V2.3.2
 * Copyright (C) 2020 Amazon.com, Inc. or its affiliates.  All Rights Reserved.
 *
 * Driver code:
 * Copyright (C) Nicholas J. Kinar <n.kinar@usask.ca>, Centre for Hydrology, University of Saskatchewan
 *
 * MSP432 Driverlib (C) 2017-2019 Texas Instruments Incorporated <https://www.ti.com/>
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy of
 * this software and associated documentation files (the "Software"), to deal in
 * the Software without restriction, including without limitation the rights to
 * use, copy, modify, merge, publish, distribute, sublicense, and/or sell copies of
 * the Software, and to permit persons to whom the Software is furnished to do so,
 * subject to the following conditions:
 *
 * The above copyright notice and this permission notice shall be included in all
 * copies or substantial portions of the Software.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS
 * FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR
 * COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER
 * IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
 * CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
 *
 * http://aws.amazon.com/freertos
 * http://www.FreeRTOS.org
 */

#include <string.h>
#include <stdint.h>
#include <stdbool.h>
#include <ti/devices/msp432e4/driverlib/driverlib.h>
#include <ti/devices/msp432e4/driverlib/emac.h>

#include "FreeRTOS.h"
#include "FreeRTOS_IP.h"
#include "FreeRTOS_IP_private.h"
#include "FreeRTOSIPConfigDefaults.h"
#include "task.h"
#include "NetworkBufferManagement.h"

#include "NetworkInterface.h"

/*
 * NOTES:
 * This is a driver for the internal MAC of the MSP432E401Y microcontroller from Texas Instruments.
 *
 * (1) See below for defines that configure and override FreeRTOS defines so that the driver can be used.
 * (2) The driver provides link up and down detection that also takes into consideration remote faults
 * and Ethernet cable plug/unplug events during data transmission.
 * (3) The EMAC hardware is automatically re-started if there is an internal error.
 * (4) The MAC address can be set from outside of the driver or read from internal flash.
 * (5) The EMAC hardware can be turned on or off from external tasks.
 * (6) The EMAC hardware is set to 10BASE-T Half Duplex to ensure that the FreeRTOS+TCP stack does not receive
 * data too quickly. This is because the 120 MHz processor cannot respond fast enough to ping floods or
 * other events.  The hardware is thereby set up so that it can respond in a robust fashion.
 * (7) Supports tickless interrupts.
 * (8) To turn on and off the EMAC, it is best to do a hard microcontroller reset.
 *
 * Recommended settings in FreeRTOSIPConfig.h:
 #define ipconfigETHERNET_DRIVER_FILTERS_FRAME_TYPES 1
 #define ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM  1
 #define ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM  1
 #define ipconfigIP_TASK_STACK_SIZE_WORDS    ( configMINIMAL_STACK_SIZE * 100 )
 #define ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS      60
 #define configTASK_NOTIFICATION_ARRAY_ENTRIES 2
 *
 #define ipconfigHAS_DEBUG_PRINTF    0
 #define ipconfigHAS_PRINTF          0
 *
 * Recommended settings in FreeRTOSConfig.h:
 #define configTICK_RATE_HZ              ( ( TickType_t ) 1000 )
 #define configUSE_PREEMPTION            1
 #define configUSE_TIME_SLICING          0
 #define configCPU_CLOCK_HZ              ( ( unsigned long ) 120000000 )
 #define configMINIMAL_STACK_SIZE        ( ( unsigned short ) 256 )
 #define configTOTAL_HEAP_SIZE           ( ( size_t ) ( 0x28000 ) )
 #define ipconfigTCP_WIN_SEG_COUNT       240
 *
 * REFERENCES:
 * [1] FreeRTOS Forum
 * [2] Texas Instruments Driverlib code examples
 */

#define RTOS_NET_UP_DOWN_TASK_NAME    "NetUpDown"
#define RTOS_NET_RX_TASK_NAME         "NetRX"
#define RTOS_NET_TX_TASK_NAME         "NetTX"
#define RTOS_NET_CHECK_TASK_NAME      "NetChk"
#define RTOS_NET_UP_DOWN_TASK_SIZE    configMINIMAL_STACK_SIZE
#define RTOS_NET_CHECK_TASK_SIZE      configMINIMAL_STACK_SIZE
#define RTOS_RX_POLL_MAC_TASK_SIZE    3 * configMINIMAL_STACK_SIZE
#define RTOS_TX_POLL_MAC_TASK_SIZE    3 * configMINIMAL_STACK_SIZE
#define NUM_TX_DESCRIPTORS            8
#define NUM_RX_DESCRIPTORS            8

#define ETH_UP_DELAY_MS               1000
#define ETH_DOWN_DELAY_MS             1000
#define ETH_MAX_TIMEOUT_CYCLES        12000000
#define ETH_STARTUP_TIMEOUT           ETH_MAX_TIMEOUT_CYCLES

#define ETH_RX_QUEUE_LEN              NUM_TX_DESCRIPTORS
#define ETH_TX_QUEUE_LEN              NUM_RX_DESCRIPTORS

/* TX Queue positions */
#define TX_QUEPOS_FIRST_EVENT         0
#define TX_QUEPOS_SECOND_EVENT        1

/* Minimum packet length is required to ensure that all of the bytes are transmitted
 * even when there are issues with the network (i.e. a network cable pulled out during TX or RX) */
#define ETHERNET_MIN_PACKET_BYTES     60

/* Ensure that the RTOS settings work well for this driver */
#if configTASK_NOTIFICATION_ARRAY_ENTRIES < 2
    #undef configTASK_NOTIFICATION_ARRAY_ENTRIES
    #define configTASK_NOTIFICATION_ARRAY_ENTRIES     2
#endif
#ifndef ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM
    #define ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM    1
#endif
#ifndef ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM
    #define ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM    1
#endif
#ifdef ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM
    #undef ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM
    #define ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM    1
#endif
#ifdef ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM
    #undef ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM
    #define ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM    1
#endif
#ifndef ipconfigETHERNET_MINIMUM_PACKET_BYTES
    #define ipconfigETHERNET_MINIMUM_PACKET_BYTES     ETHERNET_MIN_PACKET_BYTES
#endif
#ifdef ipconfigETHERNET_MINIMUM_PACKET_BYTES
    #undef ipconfigETHERNET_MINIMUM_PACKET_BYTES
    #define ipconfigETHERNET_MINIMUM_PACKET_BYTES    ETHERNET_MIN_PACKET_BYTES
#endif
#if ipconfigHAS_DEBUG_PRINTF == 1
    #warning The network interface may not work properly if ipconfigHAS_DEBUG_PRINTF 1.  Please set ipconfigHAS_DEBUG_PRINTF 0 for production use.
#endif
#ifndef __MSP432E401Y__
    #define __MSP432E401Y__
#endif

