FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/ThirdParty/MSP432/NetworkInterface.c
static bool loadMACInternal();
static bool setupEMAC();
static void offEMAC();
static void initDescriptors( uint32_t ul32Base );
static uint32_t packetTransmit( uint8_t * pui8Buf,
                                uint32_t ul32BufLen );
static void ethernetIntHandler( void );
static uint32_t processReceivedPacket( void );
static void applicationProcessFrameRX( uint32_t ul32FrameLen,
                                       uint8_t * uc8Buf,
                                       uint32_t ulindex );
static void prvCheckLinkUpOrDownTask( void * pvParameters );
static void prvEMACDeferredInterruptHandlerTask( void * pvParameters );
static bool isEMACLinkUp();
static void DMAFreeDescriptorRX( uint32_t ulindx );
static void prvEMACDeferredInterfaceOutput( void * pvParameters );
static void prvChkNetworkState( void * pvParameters );
static void vSetNetworkInterfaceConfig( const struct InternalNetworkInterfaceMSP432EConfig config );

/* EMAC interrupts */
#define EMAC_INTERRUPTS    EMAC_INT_RECEIVE | EMAC_INT_TRANSMIT | EMAC_INT_BUS_ERROR | EMAC_INT_TX_STOPPED | EMAC_INT_RX_STOPPED

/* DMA descriptors */
tEMACDMADescriptor g_psRxDescriptor[ NUM_TX_DESCRIPTORS ];
tEMACDMADescriptor g_psTxDescriptor[ NUM_RX_DESCRIPTORS ];
uint32_t ulg_ui32RxDescIndex;
uint32_t ulg_ui32TxDescIndex;

#define ETH_MAX_BUFFER_SIZE    1526
#define ETH_RX_BUFFER_SIZE     ETH_MAX_BUFFER_SIZE
#define ETH_TX_BUFFER_SIZE     ETH_MAX_BUFFER_SIZE
uint8_t ucg_ppui8RxBuffer[ NUM_RX_DESCRIPTORS ][ ETH_RX_BUFFER_SIZE ];

/* Task handles */
TaskHandle_t xTaskToNotifyEthernetRX = NULL;
TaskHandle_t xTaskToNotifyEthernetTX = NULL;
TaskHandle_t xHandleCheckLinkUpOrDown = NULL;
TaskHandle_t xHandleCheckNet = NULL;
BaseType_t xHigherPriorityTaskWokenRX = pdFALSE;
BaseType_t xHigherPriorityTaskWokenTX = pdFALSE;
BaseType_t xHigherPriorityTaskWokenCheck = pdFALSE;

/* Queue handles */
QueueHandle_t xQueueRX;
QueueHandle_t xQueueTX;

/* MAC address */
uint8_t ucpui8MACAddr[ ipMAC_ADDRESS_LENGTH_BYTES ];

/* State variable that indicates whether the network is up or down */
bool networkUP = false;
/* Check to see if the device has been setup */
static bool hasBeenSetup = false;

/* RX data input buffer */
struct NetworkInterfaceDataIn
{
    uint8_t * ucbuff;    /* buffer to the data */
    uint32_t ulbuff_siz; /* buffer size */
    uint32_t ulindx;     /* index of buffer in DMA descriptor */
};

/* TX data output buffer */
struct NetworkInterfaceDataOut
{
    NetworkBufferDescriptor_t * pxDescriptor;
    BaseType_t xReleaseAfterSend;
};

/* Local config struct */
static struct InternalNetworkInterfaceMSP432EConfig configLocal;


bool loadMACInternal()
{
    uint32_t ui32User0, ui32User1;

    /* Read the MAC address from internal flash. Bit[23:0] are stored in user register0, and Bit[47:24] are stored in user register1.
     * The MAC address can be loaded from an external IC or can be loaded from the internal registers if the registers are not zero.
     * The evaluation kit hardware uses reading from internal flash variables but this can also be used for production as well
     * if the internal flash is programmed on the assembly line. */
    FlashUserGet( &ui32User0, &ui32User1 );

    if( ( ui32User0 == 0xffffffff ) || ( ui32User1 == 0xffffffff ) )
    {
        return false;
    }

    configLocal.ucMACAddr[ 0 ] = ( ( ui32User0 >> 0 ) & 0xff );
    configLocal.ucMACAddr[ 1 ] = ( ( ui32User0 >> 8 ) & 0xff );
    configLocal.ucMACAddr[ 2 ] = ( ( ui32User0 >> 16 ) & 0xff );
    configLocal.ucMACAddr[ 3 ] = ( ( ui32User1 >> 0 ) & 0xff );
    configLocal.ucMACAddr[ 4 ] = ( ( ui32User1 >> 8 ) & 0xff );
    configLocal.ucMACAddr[ 5 ] = ( ( ui32User1 >> 16 ) & 0xff );
    return true;
}


/* This function sets up the EMAC. Not to be called directly from outside of this file. */
bool setupEMAC()
{
    uint32_t ul32Loop;
    bool rv;

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        taskENTER_CRITICAL();
    }

    if( configLocal.setMACAddrInternal == true )
    {
        rv = loadMACInternal();

        if( rv == false )
        {
            return false;
        }
    }

    /* enable and reset the internal MAC */
    SysCtlPeripheralPowerOn( SYSCTL_PERIPH_EMAC0 );
    SysCtlPeripheralPowerOn( SYSCTL_PERIPH_EPHY0 );
    SysCtlPeripheralEnable( SYSCTL_PERIPH_EMAC0 );
    SysCtlPeripheralEnable( SYSCTL_PERIPH_EPHY0 );
    SysCtlPeripheralReset( SYSCTL_PERIPH_EMAC0 );
    SysCtlPeripheralReset( SYSCTL_PERIPH_EPHY0 );

    while( !SysCtlPeripheralReady( SYSCTL_PERIPH_EMAC0 ) )
    {
    }

    /* configure the internal PHY */
    EMACPHYConfigSet( EMAC0_BASE,
                      ( EMAC_PHY_TYPE_INTERNAL |
                        EMAC_PHY_INT_MDIX_EN |
                        EMAC_PHY_AN_10B_T_HALF_DUPLEX ) );

    /* reset the MAC to latch the configuration */
    EMACReset( EMAC0_BASE );

    /* wait */
    SysCtlDelay( ETH_STARTUP_TIMEOUT );

    /* init the EMAC */
    EMACInit( EMAC0_BASE, configCPU_CLOCK_HZ,
              EMAC_BCONFIG_MIXED_BURST | EMAC_BCONFIG_PRIORITY_FIXED, 4, 4,
              0 );

    /*
     *  Since the checksum is computed in the hardware using EMAC_CONFIG_CHECKSUM_OFFLOAD,
     *  there is also a need to turn on defines in FreeRTOS+TCP as well. This is done automatically
     *  using the defines in this file.
     *
     #define ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM  1
     #define ipconfigDRIVER_INCLUDED_RX_IP_CHECKSUM  1
     */
    EMACConfigSet( EMAC0_BASE,
                   ( EMAC_CONFIG_FULL_DUPLEX |
                     EMAC_CONFIG_CHECKSUM_OFFLOAD |
                     EMAC_CONFIG_IF_GAP_96BITS |
                     EMAC_CONFIG_USE_MACADDR0 |
                     EMAC_CONFIG_BO_LIMIT_1024 ),
                   ( EMAC_MODE_RX_STORE_FORWARD | EMAC_MODE_TX_STORE_FORWARD
                   ), ETH_MAX_BUFFER_SIZE );

    /* DMA descriptors init */
    initDescriptors( EMAC0_BASE );

    /* program MAC address from the cached address */
    EMACAddrSet( EMAC0_BASE, 0, configLocal.ucMACAddr );

    /* Set address filtering */
    EMACAddrFilterSet( EMAC0_BASE, 0, EMAC_FILTER_ADDR_ENABLE | EMAC_FILTER_SOURCE_ADDR );

