FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/ThirdParty/MSP432/NetworkInterface.c
    /* Set MAC filtering options */
    EMACFrameFilterSet( EMAC0_BASE, EMAC_FRMFILTER_SADDR | EMAC_FRMFILTER_PASS_NO_CTRL );

    /* indicate that the receive descriptors are available to the DMA to start the receive processing */
    for( ul32Loop = 0; ul32Loop < NUM_RX_DESCRIPTORS; ul32Loop++ )
    {
        g_psRxDescriptor[ ul32Loop ].ui32CtrlStatus |= DES0_RX_CTRL_OWN;
    }

    /* Enable the Ethernet MAC transmitter and receiver */
    EMACTxEnable( EMAC0_BASE );
    EMACRxEnable( EMAC0_BASE );

    /* Enable the Ethernet interrupt */
    IntPrioritySet( INT_EMAC0, 0x20 ); /* (0x01 << 5) to set the priority into the last three bits for Cortex M4F */

    /* register the interrupt handler for the Ethernet MAC */
    EMACIntRegister( EMAC0_BASE, ethernetIntHandler );

    /* enable the interrupts for the EMAC */
    EMACIntClear( EMAC0_BASE, EMACIntStatus( EMAC0_BASE, false ) );
    IntEnable( INT_EMAC0 );
    EMACIntEnable( EMAC0_BASE, EMAC_INTERRUPTS );

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        taskEXIT_CRITICAL();
    }

    return true;
}


/* This function only turns off the Ethernet EMAC.  This function does not turn off any
 * of the processing tasks and therefore should not be called directly from external tasks. */
void offEMAC()
{
    uint32_t ulstatus, ulcnt;

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        taskENTER_CRITICAL();
    }

    networkUP = false;

    ulcnt = 0;
    ulstatus = EMACStatusGet( EMAC0_BASE );

    while( ulstatus )
    {
        ulstatus = EMACStatusGet( EMAC0_BASE );
        ulcnt++;

        if( ulcnt == ETH_STARTUP_TIMEOUT )
        {
            if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
            {
                taskEXIT_CRITICAL();
            }

            return;
        }
    }

    IntDisable( INT_EMAC0 );
    SysCtlPeripheralDisable( SYSCTL_PERIPH_EMAC0 );
    SysCtlPeripheralDisable( SYSCTL_PERIPH_EPHY0 );
    SysCtlPeripheralPowerOff( SYSCTL_PERIPH_EMAC0 );
    SysCtlPeripheralPowerOff( SYSCTL_PERIPH_EPHY0 );

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        taskEXIT_CRITICAL();
    }
}


/* Interrupt handler */
void ethernetIntHandler( void )
{
    uint32_t ui32Temp;

    ui32Temp = EMACIntStatus( EMAC0_BASE, true );

    if( ui32Temp & EMAC_INT_RECEIVE )
    {
        /* RX */
        processReceivedPacket();
    }
    else if( ui32Temp & EMAC_INT_TRANSMIT )
    {
        /* TX */
        vTaskNotifyGiveIndexedFromISR( xTaskToNotifyEthernetTX, TX_QUEPOS_SECOND_EVENT, &xHigherPriorityTaskWokenTX );
        portYIELD_FROM_ISR( xHigherPriorityTaskWokenTX );
    }
    else
    {
        /* Anything else other than receive or transmit is treated as an error
         * and a task is therefore used to reset the entire EMAC to ensure that the system remains functional */
        vTaskNotifyGiveFromISR( xHandleCheckNet, &xHigherPriorityTaskWokenCheck );
        portYIELD_FROM_ISR( xHigherPriorityTaskWokenCheck );
    }

    /* clear the interrupt */
    EMACIntClear( EMAC0_BASE, ui32Temp );
    /* as per Application Note SLAA739 - June 2017 */
    #if configUSE_TICKLESS_IDLE == 1
        SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;
        __DSB();
    #endif
}


/* Init the DMA descriptors */
void initDescriptors( uint32_t ul32Base )
{
    uint32_t ul32Loop;

    for( ul32Loop = 0; ul32Loop < NUM_TX_DESCRIPTORS; ul32Loop++ )
    {
        g_psTxDescriptor[ ul32Loop ].ui32Count = DES1_TX_CTRL_SADDR_INSERT;
        g_psTxDescriptor[ ul32Loop ].DES3.pLink =
            ( ul32Loop == ( NUM_TX_DESCRIPTORS - 1 ) ) ?
            g_psTxDescriptor : &g_psTxDescriptor[ ul32Loop + 1 ];
        g_psTxDescriptor[ ul32Loop ].ui32CtrlStatus =
            ( DES0_TX_CTRL_LAST_SEG | DES0_TX_CTRL_FIRST_SEG |
              DES0_TX_CTRL_INTERRUPT | DES0_TX_CTRL_CHAINED |
              DES0_TX_CTRL_IP_ALL_CKHSUMS );
    }

    for( ul32Loop = 0; ul32Loop < NUM_RX_DESCRIPTORS; ul32Loop++ )
    {
        g_psRxDescriptor[ ul32Loop ].ui32CtrlStatus = 0;
        g_psRxDescriptor[ ul32Loop ].ui32Count =
            ( DES1_RX_CTRL_CHAINED |
              ( ETH_RX_BUFFER_SIZE << DES1_RX_CTRL_BUFF1_SIZE_S ) );
        g_psRxDescriptor[ ul32Loop ].pvBuffer1 = ucg_ppui8RxBuffer[ ul32Loop ];
        g_psRxDescriptor[ ul32Loop ].DES3.pLink =
            ( ul32Loop == ( NUM_RX_DESCRIPTORS - 1 ) ) ?
            g_psRxDescriptor : &g_psRxDescriptor[ ul32Loop + 1 ];
    }

    EMACRxDMADescriptorListSet( ul32Base, g_psRxDescriptor );
    EMACTxDMADescriptorListSet( ul32Base, g_psTxDescriptor );

    ulg_ui32RxDescIndex = 0;
    ulg_ui32TxDescIndex = NUM_TX_DESCRIPTORS - 1;
}


/* Transmit a packet - call this function from the network stack
 *  pui8Buf = the buffer
 *  i32BufLen = length of the buffer
 */
uint32_t packetTransmit( uint8_t * pui8Buf,
                         uint32_t ul32BufLen )
{
    uint8_t bufferTX[ ETH_TX_BUFFER_SIZE ];

    ulg_ui32TxDescIndex++;

    if( ulg_ui32TxDescIndex == NUM_TX_DESCRIPTORS )
    {
        ulg_ui32TxDescIndex = 0;
    }

    /* The copy needs to be done here since directly assigning a pointer does not seem to work
     * and causes the transmitter to stop.  Some testing indicates that that this can be quicker than
     *  simply assigning the pointer for smaller packets. */
    memcpy( bufferTX, pui8Buf, ul32BufLen );

    g_psTxDescriptor[ ulg_ui32TxDescIndex ].ui32Count = ul32BufLen;
    g_psTxDescriptor[ ulg_ui32TxDescIndex ].pvBuffer1 = bufferTX;
    g_psTxDescriptor[ ulg_ui32TxDescIndex ].ui32CtrlStatus =
        ( DES0_TX_CTRL_LAST_SEG | DES0_TX_CTRL_FIRST_SEG |
          DES0_TX_CTRL_INTERRUPT | DES0_TX_CTRL_IP_ALL_CKHSUMS |
          DES0_TX_CTRL_CHAINED | DES0_TX_CTRL_OWN );

    EMACTxDMAPollDemand( EMAC0_BASE );
    return( ul32BufLen );
}


/* Function to process the received packet */
uint32_t processReceivedPacket( void )
{
    uint32_t ul32FrameLen;

    ul32FrameLen = 0;

    if( !( g_psRxDescriptor[ ulg_ui32RxDescIndex ].ui32CtrlStatus & DES0_RX_CTRL_OWN ) )
    {
        /* Does it have a valid frame? */
        if( !( g_psRxDescriptor[ ulg_ui32RxDescIndex ].ui32CtrlStatus &
               DES0_RX_STAT_ERR ) )
        {
            if( g_psRxDescriptor[ ulg_ui32RxDescIndex ].ui32CtrlStatus &
                DES0_RX_STAT_LAST_DESC )
            {
                /* get the frame length */
                ul32FrameLen =
                    ( ( g_psRxDescriptor[ ulg_ui32RxDescIndex ].ui32CtrlStatus &
                        DES0_RX_STAT_FRAME_LENGTH_M ) >>
                      DES0_RX_STAT_FRAME_LENGTH_S );

                /* call the function that sends the data to the task */
                applicationProcessFrameRX( ul32FrameLen,
                                           g_psRxDescriptor[ ulg_ui32RxDescIndex ].pvBuffer1, ulg_ui32RxDescIndex );
            }
        }

        /* Move on to the next RX packet */
        ulg_ui32RxDescIndex++;

        if( ulg_ui32RxDescIndex == NUM_RX_DESCRIPTORS )
        {
            ulg_ui32RxDescIndex = 0;
        }
    } /* end if */

