FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/ThirdParty/MSP432/NetworkInterface.c
    /* return the frame length */
    return ul32FrameLen;
}


/* This function passes the framelength and the RX buffer into the FreeRTOS task.
 * The function is called from the ISR and therefore must use portYIELD_FROM_ISR() */
void applicationProcessFrameRX( uint32_t ul32FrameLen,
                                uint8_t * uc8Buf,
                                uint32_t ulindex )
{
    BaseType_t rv;
    struct NetworkInterfaceDataIn NIDataIn;

    NIDataIn.ucbuff = uc8Buf;
    NIDataIn.ulbuff_siz = ul32FrameLen;
    NIDataIn.ulindx = ulindex;

    /* send the data into the queue */
    rv = xQueueSendFromISR( xQueueRX, &NIDataIn, &xHigherPriorityTaskWokenRX );

    if( rv == pdTRUE )
    {
        vTaskNotifyGiveFromISR( xTaskToNotifyEthernetRX, &xHigherPriorityTaskWokenRX );
        portYIELD_FROM_ISR( xHigherPriorityTaskWokenRX );
    }
    else
    {
        DMAFreeDescriptorRX( ulindex );
    }
}

/* Function to free the RX descriptor */
void DMAFreeDescriptorRX( uint32_t ulindx )
{
    g_psRxDescriptor[ ulindx ].ui32CtrlStatus = DES0_RX_CTRL_OWN;
}

/*
 * -------------------------------------------------------------
 * FREERTOS+TCP FUNCTIONS
 * -------------------------------------------------------------
 */

/* Call this function to populate the driver defaults struct with defaults */
void vGetInternalNetworkInterfaceMSP432EConfigDefaults( struct InternalNetworkInterfaceMSP432EConfig * config )
{
    uint32_t k;

    config->turnOnEMAC = true;
    config->setMACAddrInternal = false;

    for( k = 0; k < ipMAC_ADDRESS_LENGTH_BYTES; k++ )
    {
        config->ucMACAddr[ k ] = 0xFF;
    }
}


void vSetNetworkInterfaceConfig( const struct InternalNetworkInterfaceMSP432EConfig config )
{
    configLocal = config;
}


/* Call this function to setup the network */
bool vPublicSetupEMACNetwork( const struct InternalNetworkInterfaceMSP432EConfig config )
{
    bool rv;

    rv = false;
    BaseType_t tv;

    /* setup the MAC address and turn on the EMAC if required */
    vSetNetworkInterfaceConfig( config );

    if( config.turnOnEMAC )
    {
        rv = setupEMAC();
    }

    if( rv == false )
    {
        return false;
    }

    /* ensure that the code can only be run once to create the tasks */
    if( hasBeenSetup == true )
    {
        return true;
    }

    /* create the queues */
    xQueueRX = xQueueCreate( ETH_RX_QUEUE_LEN, sizeof( struct NetworkInterfaceDataIn ) );

    if( xQueueRX == NULL )
    {
        return false;
    }

    xQueueTX = xQueueCreate( ETH_TX_QUEUE_LEN, sizeof( struct NetworkInterfaceDataOut ) );

    if( xQueueTX == NULL )
    {
        return false;
    }

    /* RX task */
    tv = xTaskCreate( prvEMACDeferredInterruptHandlerTask,
                      RTOS_NET_RX_TASK_NAME,
                      RTOS_RX_POLL_MAC_TASK_SIZE,
                      NULL,
                      configMAX_PRIORITIES - 1,
                      &xTaskToNotifyEthernetRX );

    if( tv != pdPASS )
    {
        return false;
    }

    /* TX task */
    tv = xTaskCreate( prvEMACDeferredInterfaceOutput,
                      RTOS_NET_TX_TASK_NAME,
                      RTOS_TX_POLL_MAC_TASK_SIZE,
                      NULL,
                      configMAX_PRIORITIES - 1,
                      &xTaskToNotifyEthernetTX );

    if( tv != pdPASS )
    {
        return false;
    }

    /* Link Up/Down task */
    tv = xTaskCreate( prvCheckLinkUpOrDownTask,
                      RTOS_NET_UP_DOWN_TASK_NAME,
                      RTOS_NET_CHECK_TASK_SIZE,
                      NULL,
                      tskIDLE_PRIORITY,
                      &xHandleCheckLinkUpOrDown );

    if( tv != pdPASS )
    {
        return false;
    }

    /* Task to check the network state and reset things if something went wrong */
    tv = xTaskCreate( prvChkNetworkState,
                      RTOS_NET_CHECK_TASK_NAME,
                      RTOS_NET_CHECK_TASK_SIZE,
                      NULL,
                      tskIDLE_PRIORITY,
                      &xHandleCheckNet );

    if( tv != pdPASS )
    {
        return false;
    }

    /* latch the setup state */
    hasBeenSetup = true;

    /* the setup has succeeded */
    return true;
}


/*  Function to check the network state and then reset things accordingly if an interrupt has occurred
 *  and this indicates that something is wrong with the network.
 */
void prvChkNetworkState( void * pvParameters )
{
    for( ; ; )
    {
        ulTaskNotifyTake( pdTRUE, portMAX_DELAY );
        vPublicTurnOnEMAC();
        vTaskDelay( pdMS_TO_TICKS( ETH_DOWN_DELAY_MS ) );
    }
}


/* FreeRTOS task that handles the RX interrupt using task handle xTaskToNotifyEthernetRX */
void prvEMACDeferredInterruptHandlerTask( void * pvParameters )
{
    NetworkBufferDescriptor_t * pxDescriptor = NULL;
    IPStackEvent_t xRxEvent;
    struct NetworkInterfaceDataIn NIDataReceived;
    uint32_t xBytesReceived;

    for( ; ; )
    {
        ulTaskNotifyTake( pdTRUE, portMAX_DELAY );
        xQueueReceive( xQueueRX, &NIDataReceived, 0 );

        if( eConsiderFrameForProcessing( NIDataReceived.ucbuff ) == eProcessBuffer )
        {
            xBytesReceived = NIDataReceived.ulbuff_siz - ipSIZE_OF_ETH_CRC_BYTES; /* do not include the CRC bytes in the received size */
            pxDescriptor = pxGetNetworkBufferWithDescriptor( xBytesReceived, 0 );

            if( pxDescriptor != NULL )
            {
                memcpy( pxDescriptor->pucEthernetBuffer, NIDataReceived.ucbuff, NIDataReceived.ulbuff_siz );
                pxDescriptor->xDataLength = xBytesReceived;
                xRxEvent.eEventType = eNetworkRxEvent;
                xRxEvent.pvData = ( void * ) pxDescriptor;

                if( xSendEventStructToIPTask( &xRxEvent, 0 ) == pdTRUE )
                {
                    /* The buffer does not need to be released here since this will be done internally by the network stack */
                    iptraceNETWORK_INTERFACE_RECEIVE();
                }
                else
                {
                    /* The buffer needs to be released since we cannot send to the network stack */
                    vReleaseNetworkBufferAndDescriptor( pxDescriptor );
                    iptraceETHERNET_RX_EVENT_LOST();
                }
            }
        }

        /* Release the DMA descriptor at a specific index */
        taskENTER_CRITICAL();
        DMAFreeDescriptorRX( NIDataReceived.ulindx );
        taskEXIT_CRITICAL();
    } /* end for */
}


/* Network initialization is already done outside of this function, so this function will only
 * report if the network is initialized by returning a flag. Called directly by FreeRTOS. */
BaseType_t xNetworkInterfaceInitialise( void )
{
    if( networkUP == true )
    {
        vTaskDelay( pdMS_TO_TICKS( ETH_UP_DELAY_MS ) );
        return pdTRUE;
    }

