FreeRTOS/FreeRTOS-Plus-TCP/portable/NetworkInterface/ThirdParty/MSP432/NetworkInterface.c
    return pdFALSE;
}


/*  Task to output the data to the network interface. This allows the network stack to continue
 *  processing while the data is able to be sent. */
void prvEMACDeferredInterfaceOutput( void * pvParameters )
{
    struct NetworkInterfaceDataOut NIDataOutput;

    for( ; ; )
    {
        ulTaskNotifyTakeIndexed( TX_QUEPOS_FIRST_EVENT, pdTRUE, portMAX_DELAY );
        xQueueReceive( xQueueTX, &NIDataOutput, 0 );

        /* For ICMP packets, the checksum must be zero if the network hardware computes the checksum or the buffer will not be properly sent
         * For this driver it is required that ipconfigDRIVER_INCLUDED_TX_IP_CHECKSUM == 1 */
        ProtocolPacket_t * pxPacket;
        pxPacket = ( ProtocolPacket_t * ) ( NIDataOutput.pxDescriptor->pucEthernetBuffer );

        if( pxPacket->xICMPPacket.xIPHeader.ucProtocol == ( uint8_t ) ipPROTOCOL_ICMP )
        {
            pxPacket->xICMPPacket.xICMPHeader.usChecksum = ( uint16_t ) 0u;
        }

        taskENTER_CRITICAL();
        packetTransmit( NIDataOutput.pxDescriptor->pucEthernetBuffer, ( uint32_t ) NIDataOutput.pxDescriptor->xDataLength );
        taskEXIT_CRITICAL();

        /* wait until transmit */
        ulTaskNotifyTakeIndexed( TX_QUEPOS_SECOND_EVENT, pdTRUE, portMAX_DELAY );
        iptraceNETWORK_INTERFACE_TRANSMIT();

        if( NIDataOutput.xReleaseAfterSend )
        {
            vReleaseNetworkBufferAndDescriptor( NIDataOutput.pxDescriptor );
        }
    }
}


/*  Function to output packets to the network.
 *  Called directly by FreeRTOS. This function should not block and therefore passes
 *  all output data to a queue.  If the function blocks the network stack can become unresponsive
 *  so all of the output work is thereby done by another task. */
BaseType_t xNetworkInterfaceOutput( NetworkBufferDescriptor_t * const pxDescriptor,
                                    BaseType_t xReleaseAfterSend )
{
    struct NetworkInterfaceDataOut NIDataOutput;
    BaseType_t txResp;

    NIDataOutput.pxDescriptor = pxDescriptor;
    NIDataOutput.xReleaseAfterSend = xReleaseAfterSend;
    txResp = xQueueSend( xQueueTX, &NIDataOutput, 0 );

    if( txResp == pdTRUE )
    {
        xTaskNotifyGiveIndexed( xTaskToNotifyEthernetTX, 0 );
        return pdTRUE;
    }

    return pdFALSE;
}


/*
 * -----------------------------------------------------------------------------------------------------
 * Network interface UP or DOWN tasks and associated functions
 * -----------------------------------------------------------------------------------------------------
 */

/*  Function to check and see if the network is up or down by polling a register in the Ethernet driver.
 *  Apparently there is no other way to do this other than polling.  The register is checked for link status,
 *  but also for remote faults and this takes into consideration a pulled Ethernet cable during RX and TX.
 */
bool isEMACLinkUp()
{
    uint8_t uci8PHYAddr = 0; /* refers to the internal PHY */
    uint16_t check;

    check = EMACPHYRead( EMAC0_BASE, uci8PHYAddr, EPHY_BMSR );

    if( ( ( check & EPHY_BMSR_LINKSTAT ) == 0 ) || ( check & EPHY_BMSR_RFAULT ) )
    {
        return false; /* link is not up */
    }

    return true; /* link is up */
}


/* A task to check and see if the link is up or down by polling an EMAC register*/
void prvCheckLinkUpOrDownTask( void * pvParameters )
{
    bool check;

    check = false;

    for( ; ; )
    {
        check = isEMACLinkUp();

        if( ( check == true ) && ( networkUP == false ) )
        {
            networkUP = true;
            vTaskDelay( pdMS_TO_TICKS( 10 ) );
        }
        else if( ( networkUP == true ) && ( check == false ) )
        {
            /*   FreeRTOS will poll xNetworkInterfaceInitialise() to check if the network is up.
             *  After FreeRTOS_NetworkDown() is called, so there is no corresponding FreeRTOS_NetworkUp() function... */
            networkUP = false;
            FreeRTOS_NetworkDown();
            vTaskDelay( pdMS_TO_TICKS( 10 ) );
        }
    }
}


/* Call this network function to physically turn on the EMAC from an internal task. */
bool vPublicTurnOnEMAC()
{
    if( hasBeenSetup == false )
    {
        return false;
    }

    setupEMAC();

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        FreeRTOS_NetworkDown();
        vTaskResume( xHandleCheckLinkUpOrDown );
        vTaskResume( xHandleCheckNet );
        vTaskResume( xTaskToNotifyEthernetRX );
        vTaskResume( xTaskToNotifyEthernetTX );
    }

    return true;
}


/*  Call this function to physically turn off the EMAC from an external task.
 *  It is recommended to check the network stack for open sockets before calling this task,
 *  and only call the task after all sockets are closed and there are no connected clients.
 *  In an operational sense, the best way to turn off the EMAC is to do a hard reset. */
bool vPublicTurnOffEMAC()
{
    if( hasBeenSetup == false )
    {
        return false; /* make sure that the MAC has been setup */
    }

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        vTaskSuspend( xHandleCheckLinkUpOrDown );
        vTaskSuspend( xHandleCheckNet );
        vTaskSuspend( xTaskToNotifyEthernetRX );
        vTaskSuspend( xTaskToNotifyEthernetTX );
    }

    networkUP = false;

    if( xTaskGetSchedulerState() == taskSCHEDULER_RUNNING )
    {
        FreeRTOS_NetworkDown();                           /* Indicate to FreeRTOS that the network is down */
        vTaskDelay( pdMS_TO_TICKS( ETH_DOWN_DELAY_MS ) ); /* Wait until FreeRTOS has finished processing */
    }

    offEMAC(); /* Turn off the physical hardware */
    return true;
}


/* Call this function to obtain the MAC address used by the driver */
void vPublicGetMACAddr( uint8_t uc8MACAddrGet[ ipMAC_ADDRESS_LENGTH_BYTES ] )
{
    memcpy( uc8MACAddrGet, configLocal.ucMACAddr, ipMAC_ADDRESS_LENGTH_BYTES );
}


/*-----------------------------------------------------------------------------------------------------
 * For BufferAllocation_1.c (see the FreeRTOS documentation for further details and examples)
 * ----------------------------------------------------------------------------------------------------- */
#define BUFFER_SIZE_ALLOC1               ( ipTOTAL_ETHERNET_FRAME_SIZE + ipBUFFER_PADDING )
#define BUFFER_SIZE_ALLOC1_ROUNDED_UP    ( ( BUFFER_SIZE_ALLOC1 + 7 ) & ~0x07UL )
static uint8_t ucBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ][ BUFFER_SIZE_ALLOC1_ROUNDED_UP ];
void vNetworkInterfaceAllocateRAMToBuffers( NetworkBufferDescriptor_t pxNetworkBuffers[ ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS ] )
{
    BaseType_t x;

    for( x = 0; x < ipconfigNUM_NETWORK_BUFFER_DESCRIPTORS; x++ )
    {
        /* pucEthernetBuffer is set to point ipBUFFER_PADDING bytes in from the
         * beginning of the allocated buffer. */
        pxNetworkBuffers[ x ].pucEthernetBuffer = &( ucBuffers[ x ][ ipBUFFER_PADDING ] );

        /* The following line is also required, but will not be required in
         * future versions. */
        *( ( uint32_t * ) &ucBuffers[ x ][ 0 ] ) = ( uint32_t ) &( pxNetworkBuffers[ x ] );
    }
}
